---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridSet.Erase(Autodesk.Revit.DB.CurtainGrid)
source: html/4c9d1776-a9df-4e63-c52f-04293c17a1da.htm
---
# Autodesk.Revit.DB.CurtainGridSet.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	CurtainGrid item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.CurtainGrid`)